{"content":"<p>Macaw is called by it’s creators <em>“The next generation web design tool. Powered by the world’s most intelligent design-to-code engine”</em>. What if this is not only an exaggerated marketing description?<!--more--></p>\n\n<p>The main advantage of Macaw is that it’s <b>built by and for web designers</b>. Photoshop is a great app, but it was not intended for web designers. Photoshop made some useful improvements for web designers the last years, but it has some significant shortcomings when it comes to, for example, “<em>Responsive Web Design</em>”.</p>\n\n<p>The mockups, created with Photoshop, are static and for a <b>specific resolution</b>. Those mockups aren’t aware of a browser and how it could look on smaller (or bigger) devices. The mobile usage is constantly and rapidly growing, so this shortcoming is becoming very embarrassing. Photoshop remains, however, a fantastic tool for photographers and graphics designers.</p>\n\n<p>Macaw, on the other side, is aware of HTML, Javascript &amp; CSS specifications. It is focused on what the <b>browser</b> can do. Because of that, it can export your mockups to responsive and clean code.</p>\n\n<p><img class=\"alignnone size-full wp-image-495 full-item\" alt=\"macaw-webdesign-software\" src=\"http://webbb.be/blog/wp-content/uploads/2014/01/macaw-webdesign-software.png\" width=\"952\" height=\"325\" /></p>\n<h2>Demonstration of the Macaw webdesign software</h2>\n<p>Macaw has released an impressive “sneak peek” of the application some months ago. <a title=\"Preview published website by Macaw\" href=\"http://macaw.co/peek/sample\">The code</a>, exported by the tool, is very clean and at first sight very clever.</p>\n\n<iframe src=\"//player.vimeo.com/video/70771444\" height=\"282\" width=\"500\" allowfullscreen=\"\" frameborder=\"0\"></iframe>\n\n<p>Other, new and refreshing tools with the same objective are also worth mentioning:</p>\n<ul>\n<li><a href=\"http://froont.com/\" target=\"_blank\">FROONT</a>: browser based Responsive web design tool</li>\n<li><a href=\"https://webflow.com/\" target=\"_blank\">Webflow</a>: create responsive websites without code</li>\n<li><a href=\"http://www.divshot.com/\" target=\"_blank\">Divshot</a>: visual front-end development</li>\n</ul>\n\n<p>What do you think?</p>\n"}
